Такође можемо користити +=оператор да повежемо стринг на крај постојеће променљиве стринга. Ово може бити од велике помоћи да се прекине дугачак низ у неколико редова.
JEDNOM KADA SE KREIRA JEDAN STRING ON SE VISE NE MOZE MENJATI
Једноставан начин за додавање података на крај низа је преко push()функције.

.push()узима један или више параметара и "гура" их на крај низа.

Примери:

const arr1 = [1, 2, 3];
arr1.push(4);

const arr2 = ["Stimpson", "J", "cat"];
arr2.push(["happy", "joy"]);

\.pop()се користи за избацивање вредности са краја низа. Можемо да сачувамо ову избачену вредност тако што ћемо је доделити променљивој. Другим речима, .pop()уклања последњи елемент из низа и враћа тај елемент.

Било који тип уноса може бити избачен из низа - бројеви, стрингови, чак и угнежђени низови.

const threeArr = [1, 4, 6];
const oneDown = threeArr.pop();
console.log(oneDown);
console.log(threeArr);
Први console.logће приказати вредност 6, а други ће приказати вредност [1, 4].

pop()увек уклања последњи елемент низа. Шта ако желите да уклоните прву?

Ту .shift()долази на сцену. Ради исто као .pop(), само што уклања први елемент уместо последњег.

Пример:

const ourArray = ["Stimpson", "J", ["cat"]];
const removedFromOurArray = ourArray.shift();
removedFromOurArrayби имала вредност стринга Stimpsonи ourArrayимала би ["J", ["cat"]].

Не само да можете shiftелементе са почетка низа, већ можете и unshiftелементе на почетак низа, тј. додати елементе испред низа.

.unshift()ради тачно као .push(), али уместо додавања елемента на крај низа, unshift()додаје елемент на почетак низа.

Пример:

const ourArray = ["Stimpson", "J", "cat"];
ourArray.shift();
ourArray.unshift("Happy");
После shift, ourArrayби имало вредност ["J", "cat"]. После unshift, ourArrayби имало вредност ["Happy", "J", "cat"].

